tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

brew "asdf"
brew "coreutils" # Those that come with macOS are outdated
brew "curl"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "gettext"
brew "git"
brew "gnupg"
brew "imagemagick"
brew "libpq"
brew "libsodium"
brew "libxml2"
brew "libyaml"
brew "mas"
brew "mysql@5.7", restart_service: true, link: true, conflicts_with: ["mysql"]
brew "neovim"
brew "postgresql@9.6"
brew "postgresql", restart_service: true
brew "protobuf"
brew "readline"
brew "redis"
brew "speedtest-cli"
brew "stripe/stripe-cli/stripe"
brew "tmux"
brew "vim"
brew "zlib" # Needed for Memcached

cask "alfred"
cask "chromium"
cask "docker"
cask "figma"
cask "firefox"
cask "font-fira-code"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-source-code-pro"
cask "fork"
cask "google-drive"
cask "iterm2"
cask "keepassxc"
cask "notion"
cask "postman"
cask "qlcolorcode"
cask "rubymine"
cask "slack"
cask "skype"
cask "spotify"
cask "transmission"
cask "the-unarchiver"
cask "via"
cask "visual-studio-code"
cask "wechatwebdevtools"
cask "zoom"

mas "Bitwarden", id: 1352778147
mas "Flow", id: 1423210932
mas "Monosnap", id: 540348655
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Telegram", id: 747648890
mas "TickTick", id: 966085870
mas "Twitter", id: 1482454543
mas "WeChat", id: 836500024
mas "WeChat", id: 836500024
