tap "meltylabs/tap"
tap "sst/tap"
tap "stripe/stripe-cli"
tap "tw93/tap"
tap "manaflow-ai/cmux"

# -----------------------------------------------------------------------------
# CLI tools
# -----------------------------------------------------------------------------
brew "ansible"
brew "atuin"
brew "automake"
brew "bat"            # Better cat with syntax highlighting
brew "coreutils"      # GNU coreutils newer than macOS defaults
brew "curl"
brew "fzf"
brew "gh"             # GitHub CLI
brew "git"
brew "git-delta"      # Syntax-highlighting pager for git/diff
brew "gnupg"
brew "jq"             # JSON processor
brew "libpng"
brew "mise"           # Runtime version manager / env/task control plane
brew "neovim"
brew "ouch"
brew "protobuf"
brew "readline"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "vim"
brew "wget"
brew "yazi"
brew "yq"             # YAML processor
brew "zellij"
brew "zoxide"

# -----------------------------------------------------------------------------
# Development runtimes, databases, and libraries
# -----------------------------------------------------------------------------
brew "bitwarden-cli"
brew "gettext"
brew "libpq"
brew "libsndfile"
brew "libsodium"
brew "libxml2"
brew "libyaml"
brew "openssl@3"
brew "pgcli"          # Better PostgreSQL CLI
brew "postgresql@17", restart_service: :changed, link: true
brew "redis", restart_service: :changed
brew "tree-sitter"
brew "vips"
brew "zlib"           # Needed for some native builds

# -----------------------------------------------------------------------------
# Containers / infra / cloud
# -----------------------------------------------------------------------------
brew "colima"         # Docker Desktop alternative
brew "docker"         # Docker CLI
brew "docker-compose"
brew "k9s"
brew "kubectx"
brew "kubernetes-cli"
brew "lazydocker"     # Docker TUI
brew "rtk"
brew "sst/tap/opencode"
brew "syncthing", restart_service: :changed
brew "teleport"

# -----------------------------------------------------------------------------
# Data, media, and utilities
# -----------------------------------------------------------------------------
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "imagemagick"
brew "lazygit"        # Git TUI
brew "mas"
brew "mole"
brew "stripe"
brew "stripe-cli"
brew "tree-sitter-cli"

# -----------------------------------------------------------------------------
# GUI apps
# -----------------------------------------------------------------------------
cask "anytype"
cask "arc"
cask "blockblock"
cask "claude-code"
cask "cmux"
cask "cyberduck"
cask "element"
cask "figma"
cask "firefox"
cask "fork"
cask "gcloud-cli"
cask "google-drive"
cask "keepassxc"
cask "keka"
cask "localsend"
cask "logi-options+"
cask "lulu"
cask "microsoft-teams"
cask "mullvad-vpn"
cask "notion-calendar"
cask "obsidian"
cask "openmtp"
cask "optimage"
cask "postman"
cask "qlcolorcode"
cask "raycast"
cask "rubymine"
cask "slack"
cask "transmission"
cask "via"
cask "visual-studio-code"
cask "wechatwebdevtools"
cask "zed"
cask "zoom"

# -----------------------------------------------------------------------------
# Fonts
# -----------------------------------------------------------------------------
cask "font-fira-code"
cask "font-hack"
cask "font-jetbrains-mono-nerd-font"
cask "font-martian-mono"
cask "font-monaspace"
cask "font-sn-pro"
cask "font-source-code-pro"

# -----------------------------------------------------------------------------
# Mac App Store apps
# -----------------------------------------------------------------------------
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "Flow", id: 1423210932
mas "Keynote", id: 409183694
mas "Monosnap", id: 540348655
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Telegram", id: 747648890
mas "WeChat", id: 836500024
mas "WireGuard", id: 1451685025  
