tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

brew "ansible"
brew "asdf"
brew "coreutils" # Those that come with macOS are outdated
brew "curl"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "fluxcd/tap/flux"
brew "gettext"
brew "git"
brew "gnupg"
brew "imagemagick"
brew "k9s"
brew "kubectx"
brew "libpq"
brew "libsodium"
brew "libxml2"
brew "libyaml"
brew "mas"
brew "neovim"
brew "openssl@1.1"
brew "postgresql@9.6"
brew "postgresql@14", restart_service: true
brew "protobuf"
brew "pyenv"
brew "pyenv-virtualenv"
brew "readline"
brew "redis"
brew "ripgrep"
brew "speedtest-cli"
brew "stripe/stripe-cli/stripe"
brew "tmux"
brew "vim"
brew "wget"
brew "xquartz"
brew "zlib" # Needed for Memcached

cask "anytype"
cask "arc"
cask "appcleaner"
cask "bitwarden-cli"
cask "calibre"
cask "cyberduck"
cask "element"
cask "figma"
cask "firefox"
cask "font-fira-code"
cask "font-hack"
cask "font-martian-mono"
cask "font-monaspace"
cask "font-sn-pro"
cask "font-source-code-pro"
cask "fork"
cask "ghostty"
cask "google-drive"
cask "keepassxc"
cask "microsoft-teams"
cask "mullvadvpn"
cask "ngrock"
cask "notion-calendar"
cask "obsidian"
cask "optimage"
cask "orbstack"
cask "postman"
cask "qlcolorcode"
cask "raycast"
cask "rubymine"
cask "slack"
cask "transmission"
cask "the-unarchiver"
cask "via"
cask "visual-studio-code"
cask "wechatwebdevtools"
cask "zoom"

mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "Flow", id: 1423210932
mas "Monosnap", id: 540348655
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Telegram", id: 747648890
mas "Twitter", id: 1482454543
mas "WeChat", id: 836500024

